PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_nnlite.c
/***************************************************************************//**
* \file   cy_nnlite.c
* \version 1.0
*
*
* Provides an API implementation of the nn lite accelerator driver.
*
*
*  Patched to support PDL emulation (including on 64-bit hosts)
*
********************************************************************************
* \copyright
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*    http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/
#include "cy_device.h"
#if defined (CY_IP_MXNNLITE)

#include "cy_nnlite.h"

#if defined(IFX_USE_MXNNLITE_STREAM_EMU)
    #include "cy_nnlite_pdl_emu.h"
#endif

#if defined(__cplusplus)
extern "C" {
#endif


#if CY_IP_MXNNLITE_VERSION==1
#define   STATUS_REG_MASK (MXNNLITE_1_0_STATUS_BUSY_STATUS_Msk | \
           MXNNLITE_1_0_STATUS_ACTIVATIONSTREAMERDONE_Msk)

#define NNLITE_VAL2FLD(field, value) _VAL2FLD(MXNNLITE_1_0_##field, value)
#define MXNNLITE_REGS      ((MXNNLITE_1_0_Type*) MXNNLITE_1_0_BASE)
#else
#define   STATUS_REG_MASK (MXNNLITE_2_0_STATUS_BUSY_STATUS_Msk | \
           MXNNLITE_2_0_STATUS_ACTIVATIONSTREAMERDONE_Msk)

#define NNLITE_VAL2FLD(field, value) _VAL2FLD(MXNNLITE_2_0_##field, value)
#define MXNNLITE_REGS        ((MXNNLITE_2_0_Type*) MXNNLITE_2_0_BASE)
#endif

/*****************************************************************************/
/* Function implementation - global ('extern') and local ('static')       */
/*****************************************************************************/

/**
 *****************************************************************************
 ** nnlite driver init function, validate context structure and
 ** set driver to init state
 **
 ** [in]  context    pointer to the driver context structure
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_Init(NNLITE_Type *nnlite, cy_nnlite_context_t *context)
{

    cy_en_nnlite_status_t status;

    if ((NULL == nnlite) || (NULL == context))
    {
        status = CY_NNLITE_BAD_PARAM;
    }
    else if (context->nnliteState != CY_NNLITE_DEINIT)
    {
        status = CY_NNLITE_BAD_STATE;
    }
    else
    {
        context->nnliteState = CY_NNLITE_INIT;
        status = CY_NNLITE_SUCCESS;
    }

    return status;
}

/**
 *****************************************************************************
 ** nnlite driver deinit function check's for pending or ongoing
 ** operation and set driver state to deinit
 **
 **
 ** [in]  nnlite    base pointer of register map.
 **
 ** [in]  context    pointer to the driver context structure
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_DeInit(NNLITE_Type *nnlite, cy_nnlite_context_t *context)
{
    cy_en_nnlite_status_t status;
    if ((NULL == nnlite) || (NULL == context))
    {
        status = CY_NNLITE_BAD_PARAM;
    }
    else if ((context->nnliteState == CY_NNLITE_OP_STARTED) ||
             (context->nnliteState == CY_NNLITE_DEINIT))
    {
        /* operation is going on, can not deinit*/
        status = CY_NNLITE_BAD_STATE;
    }
    else
    {
        context->nnliteState = CY_NNLITE_DEINIT;
        status = CY_NNLITE_SUCCESS;
    }
    return status;
}

/**
 *****************************************************************************
 ** nnlite start operation, streamer should should be configured before
 ** calling this function, this function will write to start bit in CMD MEMIO
 **
 **
 ** [in]  nnlite    base pointer of register map.
 **
 ** [in]  context    pointer to the driver context structure
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_Start(NNLITE_Type *nnlite, cy_nnlite_context_t *context)
{
    cy_en_nnlite_status_t status;

    if ((NULL == nnlite) || (NULL == context))
    {
        status = CY_NNLITE_BAD_PARAM;
    }
    else if ((context->nnliteState != CY_NNLITE_CONFIG_STATE &&
              context->nnliteState != CY_NNLITE_OP_DONE)
#if !defined(IFX_USE_MXNNLITE_STREAM_EMU)
             && (nnlite == MXNNLITE_REGS)
#endif
            )
    {
        status = CY_NNLITE_BAD_STATE;
    }
    else
    {
        context->opStatus = CY_NNLITE_SUCCESS;
#if !defined(IFX_USE_MXNNLITE_STREAM_EMU)
        if (nnlite == MXNNLITE_REGS)
        {
            context->nnliteState = CY_NNLITE_OP_STARTED;
        }
#endif
        nnlite->CMD |= NNLITE_VAL2FLD(CMD_START_CMD, 1);


#if defined(IFX_USE_MXNNLITE_STREAM_EMU)
        // Emulate execution on NNlite immediately,
        // includes triggering of ISR
        NNLite_Emu_Run(nnlite);
#endif
        status = CY_NNLITE_SUCCESS;
    }
    return status;
}

/**
 *****************************************************************************
 ** nnlite stop/abort operation, can be used to stop/abort current operation
 ** or to reset all configuration, API write abort in CMD MEMIO which will
 ** reset all the registers
 **
 ** [in]  nnlite    base pointer of register map.
 **
 ** [in]  context    pointer to the driver context structure
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_Stop(NNLITE_Type *nnlite, cy_nnlite_context_t *context)
{
    cy_en_nnlite_status_t status;
    if ((NULL == nnlite) || (NULL == context))
    {
        status = CY_NNLITE_BAD_PARAM;
    }
    else
    {
        nnlite->CMD |= NNLITE_VAL2FLD(CMD_ABORT_CMD, 1);
        context->nnliteState = CY_NNLITE_INIT;
        status = CY_NNLITE_SUCCESS;
    }
    return status;

