PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_nnlite.c
}

/**
 *****************************************************************************
 ** nnlite get nnlite operation status, can be used to poll operation status
 **
 ** [in]  nnlite  base pointer of register map.
 **
 ** [out] opStatus    nnlite last operation status
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_GetOperationStatus(NNLITE_Type *nnlite, uint32_t *opStatus)
{
    cy_en_nnlite_status_t status = CY_NNLITE_SUCCESS;
    if ((NULL == nnlite) || (NULL == opStatus))
    {
        status = CY_NNLITE_BAD_PARAM;
    }
    else
    {
        *opStatus = (nnlite->STATUS & STATUS_REG_MASK);
    }

    return status;
}

#if CY_IP_MXNNLITE_VERSION==1
/**
 *****************************************************************************
 **   nnlite set Activation Type Control
 **
 **   [in]  nnlite    base pointer of register map.
 **
 **   [in]  nnLayer    NN Layer operation type
 **
 **   [in]  actEn    Output Activation enable
 **
 **   [in]  actDataSize    Activation size
 **
 **
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_ActivationTypeCtrl(NNLITE_Type *nnlite,

                             cy_en_nnlite_layer_t nnLayer,
                             bool actEn,
                             cy_en_nnlite_activation_size_t actDataSize
                            )
{
    cy_en_nnlite_status_t status;
    if ((NULL == nnlite))
    {
        status = CY_NNLITE_BAD_PARAM;
    }
    else if (nnLayer > CY_NNLITE_LAST_LAYER_CODE)
    {
        status = CY_NNLITE_BAD_PARAM;
    }
    else
    {
        nnlite->NNLAYER_ACTIVATION_TYPE_CTL =
            NNLITE_VAL2FLD(NNLAYER_ACTIVATION_TYPE_CTL_NNLAYER_TYPE_CTL, nnLayer) |
            NNLITE_VAL2FLD(NNLAYER_ACTIVATION_TYPE_CTL_ACTIVATION_FUNC_EN, actEn) |
            NNLITE_VAL2FLD(NNLAYER_ACTIVATION_TYPE_CTL_ACTIVATION_SIZE_CTL, actDataSize);
        status = CY_NNLITE_SUCCESS;
    }

    return status;

}
#endif


/**
 *****************************************************************************
 **   nnlite streamer buffer base set
 **
 **   [in]  nnlite    base pointer of register map.
 **
 **   [in]  strmId    streamer id
 **
 **   [in]  baseAddr    base address of buffer
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_StreamerBaseAddrSet(NNLITE_Type *nnlite,
                              cy_en_nnlite_streamer_id_t strmId, const void *baseAddr)
{
    cy_en_nnlite_status_t status = CY_NNLITE_SUCCESS;
    if ((NULL == nnlite) || (NULL == baseAddr))
    {
        status = CY_NNLITE_BAD_PARAM;
    }
    else
    {
        switch (strmId)
        {
        // Agents connected via RW bus-master connected to "EXP" (aka Ahb) bus on Explorer.
        case CY_NNLITE_ACTIVATION_STREAMER:
            nnlite->ACTIVATIONSTREAMERBASEADDR = (uintptr_t)cy_AhbRemapAddr(baseAddr);
            break;
        case CY_NNLITE_OUT_STREAMER:
            nnlite->OUTSTREAMERBASEADDR = (uintptr_t)cy_AhbRemapAddr(baseAddr);
            break;

        // Agents connected via (RO bus-master) connected to "CODE" bus on Explorer.
        case CY_NNLITE_WEIGHT_STREAMER:
            nnlite->WEIGHTSTREAMERBASEADDR = (uintptr_t)cy_CbusRemapAddr(baseAddr);
            break;
        case CY_NNLITE_BIAS_STREAMER:
            nnlite->BIASBASEADDR = (uintptr_t)cy_CbusRemapAddr(baseAddr);
            break;
#if CY_IP_MXNNLITE_VERSION==2
        case CY_NNLITE_SCALE_STREAMER:
            nnlite->SCALINGFACTORBASEADDR = (uintptr_t)cy_CbusRemapAddr(baseAddr);
            break;
        case CY_NNLITE_WEIGHT_COUNT_STREAMER:
            nnlite->NONZEROWEIGHTSPOINTER = (uintptr_t)cy_CbusRemapAddr(baseAddr);
            break;
        case CY_NNLITE_SPARSITY_MAP_STREAMER:
            nnlite->ACTIVATIONSTREAMERSPARSITYMAPBASEADDR = (uintptr_t)cy_CbusRemapAddr(baseAddr);
            break;
#endif
        default:
            status = CY_NNLITE_BAD_PARAM;
            break;
        }
    }

    return status;
}

#if CY_IP_MXNNLITE_VERSION==1
/**
 *****************************************************************************
 **   parse sparsity map, API will  parse sparsity bit map and update non
 **   zero weight pointer, sparsity bit map address and weight pointer in
 **   sparCfg, sparsity configuration structure

 **   [in]  sparsitybaseAddr sparsity map base address
 **
 **   [in]  sparseBitMapLen  Size of sparsity bitmap in bytes
 **
 **   [in]  activationRepeats  activation streamer repeat count
 **
 **   [out]  sparCfg sparsity configuration
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_ParseSparsity(NNLITE_Type *nnlite, const void *sparsitybaseAddr,
                        uint32_t activationRepeats, uint32_t sparseBitMapLen, cy_nnlite_sparsity_cfg_t *sparCfg)
{
    cy_en_nnlite_status_t status;
    uint32_t nonZeroWtLen;

    if ((NULL == nnlite) || (NULL == sparCfg) || (NULL == sparsitybaseAddr))
    {
        status = CY_NNLITE_BAD_PARAM;
    }
    else
    {
        /* nonzero wt pointer each of length 2 bytes */
        nonZeroWtLen =  activationRepeats * 2UL;
        sparCfg->nonZeroWtAddr = (uintptr_t)sparsitybaseAddr;
        sparCfg->sparsityBitMapAddr = (uintptr_t)sparsitybaseAddr + nonZeroWtLen;

        /* wt pointer == sparsebase + non zero wt pointer len +
         * len of sparse bit map
         * */
        sparCfg->wtAddr = (uintptr_t)sparsitybaseAddr + nonZeroWtLen + sparseBitMapLen;
        status = CY_NNLITE_SUCCESS;
    }

    return status;
}

/**
 *****************************************************************************
 **   configure sparsity from valid cy_nnlite_sparsity_cfg
 **   write non zero wt pointer and sparsity bit map MEMIO and enable sparsity
 **   in streamer mode MEMIO
 **
 **   [in]  nnlite base pointer of register map.
 **
 **   [in]  cy_nnlite_sparsity_cfg_t sparsity configuration
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_SparsityCfg(NNLITE_Type *nnlite, cy_nnlite_sparsity_cfg_t *sparCfg)
{
    cy_en_nnlite_status_t status;

