PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_nnlite.c
    if ((NULL == nnlite) || (NULL == sparCfg))
    {
        status = CY_NNLITE_BAD_PARAM;
    }
    else
    {
        nnlite->NONZEROWEIGHTSPOINTER = cy_CbusRemapAddr((uint32_t *)sparCfg->nonZeroWtAddr);
        nnlite->ACTIVATIONSTREAMERSPARSITYMAPBASEADDR = cy_CbusRemapAddr((uint32_t *)sparCfg->sparsityBitMapAddr);
        status = CY_NNLITE_SUCCESS;
    }
    return status;
}


/**
 *****************************************************************************
 ** nnlite enable sparsity in streamer mode MEMIO
 **
 **   [in]  nnlite base pointer of register map.
 **
 **   [in] sparsityEn sparsity enable
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_SparsityEnable(NNLITE_Type *nnlite, bool sparsityEn)
{
    cy_en_nnlite_status_t status;
    if (NULL == nnlite)
    {
        status = CY_NNLITE_BAD_PARAM;
    }
    else
    {
        if (sparsityEn)
        {
            nnlite->STREAMERMODES |=
                NNLITE_VAL2FLD(STREAMERMODES_ACTIVATIONSTREAMERSPARSEEN, 1);
        }
        else
        {
            nnlite->STREAMERMODES &=
                ~(NNLITE_VAL2FLD(STREAMERMODES_ACTIVATIONSTREAMERSPARSEEN, 1));
        }
        status = CY_NNLITE_SUCCESS;
    }
    return status;
}
#endif

#if CY_IP_MXNNLITE_VERSION==1
/**
 *****************************************************************************
 **   nnlite activation streamer configuration set, API will configure
 **   parameters for activation streamer
 **
 **   [in]  nnlite    base pointer of register map.
 **
 **   [in]  context     pointer to the driver context structure
 **
 **   [in]  filterWidth  filter width
 **
 **   [in]  filterHeight   filter height
 **
 **   [in]  activationRepeats  activation streamer repeat count
 **
 **   [in]  inputWidth  input activation Width
 **
 **   [in]  inputHeight  input activation Height
 **
 **   [in]  inputChannel   input activation channels
 **
 **   [in]  startCol   starting column for activation
 **
 **   [in]  startRow   starting row for activation
 **
 **   [in]  padVal  padding value
 **
 **   [in]  padHeight  padding Height
 **
 **   [in]  padWidth   padding Width
 **
 **   [in]  strideCol  Stride column
 **
 **   [in]  strideRow  Stride rows
 **
 **   [in]  inputOffset input offset value
 *****************************************************************************/
#else
/**
 *****************************************************************************
 **   nnlite activation streamer configuration set, API will configure
 **   parameters for activation streamer
 **
 **   [in]  nnlite    base pointer of register map.
 **
 **   [in]  context     pointer to the driver context structure
 **
 **   [in]  filterWidth  filter width
 **
 **   [in]  filterHeight   filter height
 **
 **   [in]  activationRepeats  activation streamer repeat count
 **
 **   [in]  inputWidth  input activation Width
 **
 **   [in]  inputHeight  input activation Height
 **
 **   [in]  inputChannel   input activation channels
 **
 **   [in]  padVal  padding value
 **
 **   [in]  padHeight  padding Height
 **
 **   [in]  padWidth   padding Width
 **
 **   [in]  strideCol  Stride column
 **
 **   [in]  strideRow  Stride rows
 **
 **   [in]  inputOffset input offset value
 *****************************************************************************/
#endif
cy_en_nnlite_status_t
Cy_NNLite_ActivationStreamerCfg(NNLITE_Type *nnlite, cy_nnlite_context_t *context,
                                uint32_t filterWidth, uint32_t filterHeight,
                                uint32_t activationRepeats, uint32_t inputWidth,
                                uint32_t inputHeight, uint32_t inputChannel,
#if CY_IP_MXNNLITE_VERSION==1
                                uint32_t startCol, uint32_t startRow,
#endif
                                int16_t padVal, uint8_t padWidth, uint8_t padHeight,
                                uint8_t strideCol, uint8_t strideRow,
                                int32_t inputOffset)
{
    cy_en_nnlite_status_t status;
    uint32_t startColChannelTimesPadWidth;
    uint32_t startRowPadHeight;
    uint32_t padWidthTimesChannel;

    if ((NULL == nnlite) || (NULL == context))
    {
        status = CY_NNLITE_BAD_PARAM;
    }
    else if ((context->nnliteState == CY_NNLITE_INIT) ||
             (context->nnliteState ==  CY_NNLITE_OP_DONE))
    {
#if CY_IP_MXNNLITE_VERSION!=1
        static const int32_t startCol = 0;
        static const int32_t startRow = 0;
#endif
        padWidthTimesChannel = padWidth * inputChannel;
        startColChannelTimesPadWidth = startCol - padWidthTimesChannel;
        startRowPadHeight = startRow - padHeight;

        nnlite->ACTIVATIONSTREAMEROFFSET = (uint32_t)inputOffset;
        /* weights dims*/
        nnlite->ACTIVATIONSTREAMERKERNELCHANNELTIMESWIDTH = (filterWidth * inputChannel);
        nnlite->ACTIVATIONSTREAMERKERNELHEIGHT = filterHeight;

        /* is equal to number of filters for conv or equal to filer 2nd dimension for fc layer */
        nnlite->ACTIVATIONSTREAMERREPEATS = activationRepeats;

        /* input dims */
        nnlite->ACTIVATIONSTREAMERCHANNELTIMESWIDTH = (inputWidth * inputChannel);
        nnlite->ACTIVATIONSTREAMERHEIGHT = inputHeight;
        nnlite->ACTIVATIONSTREAMERSTARTCOL =  startColChannelTimesPadWidth;
        nnlite->ACTIVATIONSTREAMERSTARTROW = startRowPadHeight;
        nnlite->ACTIVATIONSTREAMERPADDING =
            NNLITE_VAL2FLD(ACTIVATIONSTREAMERPADDING_ACTIVATIONSTREAMERPADVALUE, padVal);

        nnlite->STRIDE =
            NNLITE_VAL2FLD(STRIDE_STRIDECHANNELTIMESCOLUMN, strideCol * inputChannel) |
            NNLITE_VAL2FLD(STRIDE_STRIDEROW, strideRow);
#if CY_IP_MXNNLITE_VERSION!=1
        nnlite->ACTIVATIONSTREAMERCHANNEL = inputChannel;
#endif
        status = CY_NNLITE_SUCCESS;
    }
    else
    {
        status = CY_NNLITE_BAD_STATE;
    }
    return status;
}

/**
 *****************************************************************************
 **   nnlite weight streamer configuration set, API will configure offset
 **   for weight streamer and weights per neuron parameter
 **
 **   [in]  nnlite    base pointer of register map.
 **
 **   [in]  context    pointer to the driver context structure
 **
 **   [in]  weightPerNeuron  wight/filter elements count per neuron
 **
 **   [in]  filterOffset   wight/filter elements offset value
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_WeightStreamerCfg(NNLITE_Type *nnlite, cy_nnlite_context_t *context,
                            uint32_t weightPerNeuron, int32_t filterOffset)
{
    cy_en_nnlite_status_t status;
    if ((NULL == nnlite) || (NULL == context))
    {
        status = CY_NNLITE_BAD_PARAM;
    }
    else
    {
        nnlite->WEIGHTSTREAMERKERNELCHANNELTIMESHEIGHTTIMESWIDTH = weightPerNeuron;
        nnlite->WEIGHTSTREAMEROFFSET = (uint32_t)filterOffset;
        status = CY_NNLITE_SUCCESS;
    }
    return status;
}
#if CY_IP_MXNNLITE_VERSION==1
/**
 *****************************************************************************
 **   nnlite out streamer configuration set, API will set clipping mask,
 **   offset, scaling factor ,width and height for output streamer
 **
 **   [in]  nnlite    base pointer of register map.
 **
 **   [in]  context    pointer to the driver context structure
 **
 **   [in]  clipping     output clipping setting mask or  max/min values
 **
 **   [in]  outputOffset   output elements offset value
 **
 **   [in]  outputScalingFactor  pointer output scaling factor(s)
 **
 *****************************************************************************/
#else
/**
 *****************************************************************************
 **   nnlite out streamer configuration set, API will set clipping mask,
 **   offset, scaling factor ,width and height for output streamer
 **
 **   [in]  nnlite    base pointer of register map.
 **
 **   [in]  context    pointer to the driver context structure
 **
 **   [in]  clipping     output clipping setting mask or  max/min values
 **
 **   [in]  outputOffset   output elements offset value
 **
 **   [in]  outputChannels  output Channels
 **
 *****************************************************************************/
#endif
cy_en_nnlite_status_t
Cy_NNLite_OutputStreamerCfg(NNLITE_Type *nnlite, cy_nnlite_context_t *context,
                            cy_nnlite_clipping_t clipping, int32_t outputOffset,
                            uint32_t outputWidth, uint32_t outputHeight,
#if CY_IP_MXNNLITE_VERSION==1
                            float outputScalingFactor
#else
                            uint32_t outputChannels
#endif
                           )
{
    cy_en_nnlite_status_t status;
    if ((NULL == nnlite) || (NULL == context))
    {
        status = CY_NNLITE_BAD_PARAM;
    }
    else
    {
#if CY_IP_MXNNLITE_VERSION==1
        void *scalingFactorPtr = (void *)&outputScalingFactor;
        nnlite->OUTSTREAMERCLIPPINGMASK = clipping;
        // Raw bits of the IEEE 32-bit f.p. value
        nnlite->OUTSTREAMERSCALINGFACTOR = *(uint32_t *)scalingFactorPtr;
#else
        nnlite->OUTSTREAMERCLIPPING =
            NNLITE_VAL2FLD(OUTSTREAMERCLIPPING_OUTSTREAMERCLIPPINGVALUEMIN, clipping.min) |
            NNLITE_VAL2FLD(OUTSTREAMERCLIPPING_OUTSTREAMERCLIPPINGVALUEMAX, clipping.max);
        nnlite->OUTPUTCHANNELS = outputChannels;
#endif
        nnlite->OUTPUTWIDTH = outputWidth;
        nnlite->OUTPUTHEIGHT = outputHeight;
        nnlite->OUTSTREAMEROUTPUTOFFSET = (uint32_t)outputOffset;
#if !defined(IFX_USE_MXNNLITE_STREAM_EMU)
        if (nnlite == MXNNLITE_REGS)
        {
            context->nnliteState = CY_NNLITE_CONFIG_STATE;
        }
#endif
        status = CY_NNLITE_SUCCESS;
    }
    return status;
}

