PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_nnlite.c
#if CY_IP_MXNNLITE_VERSION==1
/**
 *****************************************************************************
 **   nnlite bias streamer enable
 **
 **   [in]  nnlite   base pointer of register map.
 **
 **   [in]  biasEn   bias streamer enable
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_BiasStreamerEnable(NNLITE_Type *nnlite, bool biasEn)
{
    cy_en_nnlite_status_t status;

    if (NULL == nnlite)
    {
        status = CY_NNLITE_BAD_PARAM;
    }
    else
    {
        status = CY_NNLITE_SUCCESS;
        if (biasEn)
        {
            nnlite->STREAMERMODES |= NNLITE_VAL2FLD(STREAMERMODES_BIASEN, 1);
        }
        else
        {
            nnlite->STREAMERMODES &= ~(NNLITE_VAL2FLD(STREAMERMODES_BIASEN, 1));
        }
    }
    return status;
}


/**
 *****************************************************************************
 **   nnlite set Interpolation lookup table to be used along
 **   with Cy_NNLite_SetinterpolationParam. For lut 0 and lut 1 both,
 **   Cy_NNLite_SetinterpolationParam need to be set.
 **
 **   [in]  nnlite    base pointer of register map.
 **
 **   [in]  lut      lookup table
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_SetInterpolationLUTAddr(NNLITE_Type *nnlite, bool lut)
{
    cy_en_nnlite_status_t status;
    if (NULL == nnlite)
    {
        status = CY_NNLITE_BAD_PARAM;
    }
    else
    {
        if (lut)
        {
            nnlite->INTERPOLATIONLUTADDR = 1U;
        }
        else
        {
            nnlite->INTERPOLATIONLUTADDR = 0U;
        }
        status = CY_NNLITE_SUCCESS;
    }
    return status;
}


/**
 *****************************************************************************
 ** Set interpolation parameters.
 **
 ** [in]  nnlite  nnlite base pointer.
 **
 ** [in] slope    number of elements.
 **
 ** [in] intercept  intercept value.
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_SetInterpolationParam(NNLITE_Type *nnlite,
                                uint16_t slope, uint16_t intercept)
{
    cy_en_nnlite_status_t status;
    if (NULL == nnlite)
    {
        status = CY_NNLITE_BAD_PARAM;
    }
    else
    {
#if defined(IFX_USE_MXNNLITE_STREAM_EMU)
        nnlite->INTERPOLATIONLUTWDATA[nnlite->INTERPOLATIONLUTADDR] =
            NNLITE_VAL2FLD(INTERPOLATIONLUTWDATA_INTERPOLATIONSLOPE, slope) |
            NNLITE_VAL2FLD(INTERPOLATIONLUTWDATA_INTERPOLATIONYINTERCEPT, intercept);
#else
        nnlite->INTERPOLATIONLUTWDATA =
            NNLITE_VAL2FLD(INTERPOLATIONLUTWDATA_INTERPOLATIONSLOPE, slope) |
            NNLITE_VAL2FLD(INTERPOLATIONLUTWDATA_INTERPOLATIONYINTERCEPT, intercept);
#endif
        status = CY_NNLITE_SUCCESS;
    }

    return status;
}

#else

/**
 * @brief Raw bits representing IEEE754 float value
 *;
 * @param x
 * @return raw bits representation of input.
 */
static inline uint32_t Cy_NNLite_Float_Rawbits(float x)
{
    union float_bits
    {
        float fval;
        uint32_t rawbits;
    }   mush;
    mush.fval = x;
    return mush.rawbits;
}

/**
 *****************************************************************************
 ** \brief  Set pre/post arithmetic/accumulation scaling
 **
 ** \param [in]   nnlite    base pointer of NNLIte register map.
 **
 ** \param [in]   preScalingFactor Pre-scaling factor to input prior to arithmetic/accumulation operation
 **
 ** \param [in]   postScalingFactors    Post-scaling factor(s) to be applied after arithmetic/accumulation
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 ** @note Scale factors are restricted IEEE754 float values.  For NNLite V2.0
 ** supported exponents [8,-24] are supported.   Mantissa is rounded to 16-bits.  Non Nan etc.
 **
 **
 *****************************************************************************/

cy_en_nnlite_status_t
Cy_NNLite_SetPrePostScaling(NNLITE_Type *nnlite, float preScalingFactor, const float *postScalingFactors)
{
    cy_en_nnlite_status_t status;
    if (NULL == nnlite)
    {
        status = CY_NNLITE_BAD_PARAM;
    }
    else
    {
        nnlite->SCALINGFACTORBASEADDR = (uintptr_t)cy_CbusRemapAddr((void *)postScalingFactors);
        nnlite->INPUTRESCALINGFACTOR = Cy_NNLite_Float_Rawbits(preScalingFactor);
        status = CY_NNLITE_SUCCESS;
    }
    return status;
}

/**
 *****************************************************************************
 ** \brief  set interpolation parameters
 **
 ** \param [in]   nnlite    base pointer of NNLIte register map.
 **
 ** \param [in]   segment  lookup segment table  addr (0: [-inf..0], 1: [0..inf] )
 **
 ** \param [in]   gradient     slope value for interpolation (IEEE 32-bit
 ** float mantissa will be rounded to 7 bits)
 **
 **
 ** \retval Refer \ref cy_en_nnlite_status_t
 **
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_SetInterpolationParam(NNLITE_Type *nnlite,
                                uint32_t segment,
                                float gradient)
{
    cy_en_nnlite_status_t status;
    if (NULL == nnlite || segment > 1)
    {
        status = CY_NNLITE_BAD_PARAM;
    }
    else
    {
        uint32_t *lut_regs_base = (uint32_t*)&nnlite->INTERPOLATIONLUTDATA0;
        uint32_t slope_bits = Cy_NNLite_Float_Rawbits(gradient);
        lut_regs_base[segment] = slope_bits;
        status = CY_NNLITE_SUCCESS;
    }

    return status;

}

/**
 *****************************************************************************
 *
 * @brief Configure NNLite for Q1.15 complex FFT
 *
 * NNLite implements Decimation-in-Time   Radix-2 FFT
 *
 * @note FFT length =^= Number complex input values *2 = #
 * @param [in]  nnlite  base pointer of NNLIte register map.
 * @param [in] context  pointer to the driver context structure.
 * @param [in] ppBuf0   Input / ping-pong buffer 0, Output (even stages/# values)
 * @param [in] ppBuf1   ping-pong buffer 1, Output (odd stages/# values)
 * @param [in] fftStages   log_2(FFT length)
 *
 * @retval Refer \ref cy_en_nnlite_status_t
 *****************************************************************************
 */

cy_en_nnlite_status_t
Cy_NNLite_FFTCfg(NNLITE_Type *nnlite,
                 cy_nnlite_context_t *context,
                 void *ppBuf0, void *ppBuf1,
                 unsigned int fftStages)
{
    cy_en_nnlite_status_t status;

    if ((NULL == ppBuf0) || (NULL == ppBuf1))
    {
        return CY_NNLITE_BAD_PARAM;
    }
    if (fftStages < 4u || fftStages > 10u)
    {
        return CY_NNLITE_BAD_PARAM;
    }
    status = Cy_NNLite_StreamerBaseAddrSet(nnlite, CY_NNLITE_ACTIVATION_STREAMER, ppBuf0);
    if (status != CY_NNLITE_SUCCESS)
    {
        return status;
    }
    status = Cy_NNLite_StreamerBaseAddrSet(nnlite, CY_NNLITE_WEIGHT_STREAMER, ppBuf0);
    if (status != CY_NNLITE_SUCCESS)
    {
        return status;
    }
    status = Cy_NNLite_StreamerBaseAddrSet(nnlite, CY_NNLITE_OUT_STREAMER, ppBuf1);
    if (status != CY_NNLITE_SUCCESS)
    {
        return status;
    }
    status = Cy_NNLite_StreamerBaseAddrSet(nnlite, CY_NNLITE_BIAS_STREAMER, ppBuf1);
    if (status != CY_NNLITE_SUCCESS)
    {
        return status;
    }

