PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_nnlite.c
    // 2* length FFT = 2 * 2^(# FFT stages)
    nnlite->WEIGHTSTREAMERKERNELCHANNELTIMESHEIGHTTIMESWIDTH =
        1 << (1 + fftStages);
    nnlite->OUTPUTWIDTH = fftStages;
    nnlite->NNLAYER_CTL =
        _VAL2FLD(MXNNLITE_2_0_NNLAYER_CTL_INPUT_SIZE_CTL, CY_NNLITE_ACTIVATION_16BIT) |
        _VAL2FLD(MXNNLITE_2_0_NNLAYER_CTL_WEIGHT_SIZE_CTL, CY_NNLITE_ACTIVATION_16BIT) |
        _VAL2FLD(MXNNLITE_2_0_NNLAYER_CTL_OUTPUT_SIZE_CTL, CY_NNLITE_OUTPUT_32BIT) |
        _VAL2FLD(MXNNLITE_2_0_NNLAYER_CTL_FETCH_MODE, CY_NNLITE_ACT_WGT) |
        _VAL2FLD(MXNNLITE_2_0_NNLAYER_CTL_WPREFETCH_LEN, CY_NNLITE_PREFETCH_WORD_4x128) |
        _VAL2FLD(MXNNLITE_2_0_NNLAYER_CTL_FFT_EN, 1);
#if !defined(IFX_USE_MXNNLITE_STREAM_EMU)
    if (nnlite == MXNNLITE_REGS)
    {
        context->nnliteState = CY_NNLITE_CONFIG_STATE;
    }
#endif
    return status;
}

#endif

/**
 *****************************************************************************
 **   nnlite get nnlite interrupt status
 **
 **   [in]  nnlite    base pointer of register map.
 **
 **   [out]  intrStatus    nnlite interrupt status register
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_GetInterruptStatus(NNLITE_Type *nnlite, uint32_t *intrStatus)
{
    cy_en_nnlite_status_t status;

    if ((NULL == nnlite) || (NULL == intrStatus))
    {
        status = CY_NNLITE_BAD_PARAM;
    }
    else
    {
        *intrStatus   = nnlite->INTR;
        status = CY_NNLITE_SUCCESS;
    }

    return status;

}

/**
 *****************************************************************************
 **   get nnlite interrupt mask
 **
 **   [in]  nnlite    base pointer of register map.
 **
 **   [out]  intrMask  nnlite interrupt mask
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_GetInterruptMask(NNLITE_Type *nnlite, uint32_t *intrMask)
{
    cy_en_nnlite_status_t status;

    if ((NULL == nnlite) || (NULL == intrMask))
    {
        status = CY_NNLITE_BAD_PARAM;
    }
    else
    {
        *intrMask = nnlite->INTR_MASK;
        status = CY_NNLITE_SUCCESS;
    }
    return status;

}

/*****************************************************************************
**   nnlite get driver state
**
**   [in]  nnlite base pointer of register map.
**
**   [in]  context    pointer to the driver context structure
**
**   [out]  nnliteState nnlite driver state
*****************************************************************************/
cy_en_nnlite_status_t Cy_NNLite_GetDriverState(NNLITE_Type *nnlite,
        cy_nnlite_context_t *context,
        cy_en_nnlite_state_t *nnliteState)
{
    cy_en_nnlite_status_t status = CY_NNLITE_SUCCESS;
    if ((NULL == nnlite) || (NULL == nnliteState))
    {
        status = CY_NNLITE_BAD_PARAM;
    }
    else
    {
        *nnliteState = context->nnliteState;
    }
    return status;
}

/**
 *****************************************************************************
 **    nnlite set datawire trigger control, trigger datawire for next layer
 **   when trigger is 1
 **
 **   [in]  nnlite    base pointer of register map.
 **
 **   [in]  trigEn  datawire trigger enable
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_DatawireTriggerEnable(NNLITE_Type *nnlite, bool trigEn)
{
    cy_en_nnlite_status_t status;

    if (NULL == nnlite)
    {
        status = CY_NNLITE_BAD_PARAM;
    }
    else
    {
        nnlite->TRIG_MASK = (uint32_t)trigEn;
        status = CY_NNLITE_SUCCESS;
    }
    return status;
}

/**
 *****************************************************************************
 **    nnlite set interrupt mask, available interrupt are operation STATUS Done,
 **    MEM Fetch Error different streamers, Output Saturation interrupt
 **
 **   [in]  nnlite    base pointer of register map.
 **
 **   [in]  intrMask      interrupt mask value
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_SetInterruptMask(NNLITE_Type *nnlite, uint32_t intrMask)
{
    cy_en_nnlite_status_t status;

    if (NULL == nnlite)
    {
        status = CY_NNLITE_BAD_PARAM;
    }
    else
    {
        nnlite->INTR_MASK = (intrMask & 0x7FUL);
        status = CY_NNLITE_SUCCESS;
    }
    return status;

}

/**
 *****************************************************************************
 **    clear nnlite interrupts
 **
 **   [in]  nnlite    base pointer of register map.
 **
 **   [in]  intrMask     nnlite interrupts to be cleared
 *****************************************************************************/
cy_en_nnlite_status_t
Cy_NNLite_InterruptClear(NNLITE_Type *nnlite, uint32_t intrMask)
{
    cy_en_nnlite_status_t status;

    if (NULL == nnlite)
    {
        status = CY_NNLITE_BAD_PARAM;
    }
    else
    {
        // INTR is a write-1-to-clear register ...
#if defined(IFX_USE_MXNNLITE_STREAM_EMU)
        // Emulate RW1C behaviour....
        nnlite->INTR &= ~(intrMask & 0x7Fu);
#else
        nnlite->INTR &= (intrMask & 0x3FFu);
#endif
        status = CY_NNLITE_SUCCESS;
    }
    return status;

}

/**
 *****************************************************************************
 **    interrupt mask to status mapping
 **
 **   [in]  intrStatus interrupt status
 *****************************************************************************/

#if CY_IP_MXNNLITE_VERSION==1
static cy_en_nnlite_status_t
Cy_NNLite_InterruptStatusToErrMap(uint32_t intrStatus)
{
    cy_en_nnlite_status_t status;
    switch (intrStatus)
    {
    case MXNNLITE_1_0_INTR_INTR_DONE_Msk:
        status = CY_NNLITE_SUCCESS;
        break;
    case MXNNLITE_1_0_INTR_INTR_MEM_ERR_SPARSITY_Msk:
        status = CY_NNLITE_MEM_ERR_SPARSITY;
        break;
    case MXNNLITE_1_0_INTR_INTR_MEM_ERR_ACTIVATIONSTREAMER_Msk:
        status = CY_NNLITE_MEM_ERR_ACTIVATION_STREAMER;
        break;
    case MXNNLITE_1_0_INTR_INTR_MEM_ERR_WEIGHTSTREAMER_Msk:
        status = CY_NNLITE_MEM_ERR_WEIGHT_STREAMER;
        break;
    case MXNNLITE_1_0_INTR_INTR_MEM_ERR_BIASSTREAMER_Msk:
        status = CY_NNLITE_MEM_ERR_BIAS_STREAMER;
        break;
    case MXNNLITE_1_0_INTR_INTR_MEM_ERR_OUTPUTSTREAMER_Msk:
        status = CY_NNLITE_MEM_ERR_OUTPUT_STREAMER;
        break;
    case MXNNLITE_1_0_INTR_INTR_SATURATION_Msk:/* fall through for saturation */
    case (MXNNLITE_1_0_INTR_INTR_DONE_Msk | MXNNLITE_1_0_INTR_INTR_SATURATION_Msk) :
        status = CY_NNLITE_SATURATION;
        break;
    default :
        status = CY_NNLITE_SUCCESS;
        break;

