PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_nnlite.c
    }
    return status;
}
#else
static cy_en_nnlite_status_t
Cy_NNLite_InterruptStatusToErrMap(uint32_t intrStatus)
{
    cy_en_nnlite_status_t status;
    if (intrStatus & NNLITE_INTR_READ_ERRORS_MASK)
    {
        status = CY_NNLITE_MEM_READ_ERR;
    }
    else if (intrStatus & NNLITE_INTR_WRITE_ERRORS_MASK)
    {
        status = CY_NNLITE_MEM_WRITE_ERR;
    }
    else if (intrStatus & NNLITE_SATURATION_MASK)
    {
        status = CY_NNLITE_SATURATION_EVENT;
    }
    else
    {
        status = CY_NNLITE_SUCCESS;
    }
    return status;
}
#endif

/**
 *****************************************************************************
 ** wait for completion of operation, will wait for BUSY_STATUS to go low,
 ** in busy loop
 **
 ** [in]  nnlite    base pointer of register map.
 **
 ** [in]  context    pointer to the driver context structure
*****************************************************************************/
cy_en_nnlite_status_t Cy_NNLite_WaitForCompletion(NNLITE_Type *nnlite,
        cy_nnlite_context_t *context)
{
    cy_en_nnlite_status_t status;
    uint32_t interruptStatus;
    if ((NULL == nnlite) || (NULL == context))
    {
        status = CY_NNLITE_BAD_PARAM;
    }
    else
    {
        /* poll for Busy bit */
        do
        {
        }
        while (1U == (nnlite->STATUS & STATUS_REG_MASK));

        (void)Cy_NNLite_GetInterruptStatus(nnlite, &interruptStatus);
        status = Cy_NNLite_InterruptStatusToErrMap(interruptStatus);
        (void)Cy_NNLite_InterruptClear(nnlite, interruptStatus);

        if (context->nnliteState == CY_NNLITE_OP_STARTED)
        {
            context->nnliteState = CY_NNLITE_OP_DONE;
        }
    }
    return status;
}

/**
 *****************************************************************************
 **    nnlite  ISR handler
 **
 **   [in]  nnlite    base pointer of register map.
 **
 **   [in]  context    nnlite context structure pointer
 *****************************************************************************/
void Cy_NNLite_InterruptHandler(NNLITE_Type *nnlite,
                                cy_nnlite_context_t *context)
{
    uint32_t intrStatus = 0;

    (void)Cy_NNLite_GetInterruptStatus(nnlite, &intrStatus);
    if (context->nnliteState == CY_NNLITE_OP_STARTED)
    {
        context->opStatus = Cy_NNLite_InterruptStatusToErrMap(intrStatus);
        context->opIntrStatus = intrStatus;
        context->nnliteState = CY_NNLITE_OP_DONE;
    }

    (void)Cy_NNLite_InterruptClear(nnlite, intrStatus);
}


#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXNNLITE */

/* [] END OF FILE */
